Merge pull request #2 from undeemed/revamp
feat: walkthrough and flow
